// Задача №6

Console.Write("Введите число: ");
int number1 = Convert.ToInt32(Console.ReadLine());
